//Преобразование типов
//3 типа преобразования - string, number, boolean

//преобразование к строке
String(454); //"454"

5+'1'; //автоматом конвертит в стоку

938457 + ''; //тоже преобразует к строке

var i = 94857;
i.toString();



//преобразование к числу
Number("1024"); //1024

+"123134"; //быстрое преобразование в число

+true; //1

+false; //0

parseInt( '10.24px', 10 ); //10 - второй параметр система исчисления
parseFloat( '10.24px', 10 ); // 10.24



//преобразование к bool

Boolean(3987); //true

Boolean(0); //false

!!"24"; //бытрое преобразование к bool



//NaN!
+"dljskf"//Nan

